cases/serpentine_small/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
convertToMeters 1;
vertices ((-0.005 -0.005 0) (0.005 -0.005 0) (0.005 0.005 0) (-0.005 0.005 0) (-0.005 -0.005 0.00085) (0.005 -0.005 0.00085) (0.005 0.005 0.00085) (-0.005 0.005 0.00085));
blocks (hex (0 1 2 3 4 5 6 7) (50 50 17) simpleGrading (1 1 1));
edges ();
boundary
(
    inlet { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 5 6 2)); }
    wallSouth { type wall; faces ((0 1 5 4)); }
    wallNorth { type wall; faces ((3 7 6 2)); }
    catalyst { type wall; faces ((0 3 2 1)); }
    top { type wall; faces ((4 5 6 7)); }
);
