cases/serpentine_small/system/createPatchDict
FoamFile { version 2.0; format ascii; class dictionary; object createPatchDict; }
pointSync false;
patches
(
    {
        name catalyst;
        patchInfo { type wall; }
        constructFrom set;
        set catalystFaces;
    }
);
