cases/serpentine_small/system/snappyHexMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object snappyHexMeshDict; }
castellatedMesh true;
// The CAD is axis-aligned with the level-1 Cartesian lattice; retaining the
// castellated faces avoids the small concave cells produced by point snapping.
snap false;
addLayers false;
geometry { fluid { type triSurfaceMesh; file "fluid.stl"; } }
castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 5;
    nCellsBetweenLevels 1;
    features ();
    refinementSurfaces { fluid { level (1 1); patchInfo { type wall; } } }
    resolveFeatureAngle 30;
    refinementRegions {};
    locationInMesh (-0.0048 -0.0040 0.00060);
    allowFreeStandingZoneFaces false;
}
snapControls { nSmoothPatch 3; tolerance 1.5; nSolveIter 30; nRelaxIter 5; }
addLayersControls
{
    relativeSizes true;
    layers {};
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}
writeFlags (scalarLevels);
debug 0;
mergeTolerance 1e-6;
