cases/serpentine_small/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          93;
        startFace       253370;
    }
    outlet
    {
        type            patch;
        nFaces          93;
        startFace       253463;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2358;
        startFace       253556;
    }
    fluid
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32512;
        startFace       255914;
    }
    catalyst
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9616;
        startFace       288426;
    }
)

// ************************************************************************* //
