cases/serpentine_small/0.orig/permeability
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      permeability;
}

dimensions      [0 2 0 0 0 0 0];
internalField   uniform (1e-9 0 0 1e-9 0 1e-12);
boundaryField
{
    ".*" { type zeroGradient; }
}
